export default function AboutUs() {
  const desktopStyle = {
    backgroundColor: "ButtonFace",
    paddingBlock: "20px",
    paddingInline: "130px",
  };

  const mobileStyle = {
    backgroundColor: "ButtonFace",
    paddingBlock: "20px",
    paddingInline: "30px",
  };

  return (
    <div style={window.innerWidth > 600 ? desktopStyle : mobileStyle}>
      <h2>درباره ما</h2>
      <p>ما که هستیم؟</p>
      در برق شهر می توانید اطمینان یابید که محصول شما از کیفیت بالایی برخوردار
      است و همه محصولات دارای گارانتی معتبر هستند که باعث می شود با خیال راحت
      تری خریدتان را انجام دهید. ضمنا ما یکی از مزایای برق شهر پشتیبانی 24 ساعته
      آن است. در واقع مشکلاتی چون محصول فیک یا معیوب، عدم پشتیبانی یا بازپس‌گیری
      کالا، صرف هزینه و زمان بسیار در خرید سنتی، بسیاری را همیشه با دیده تردید و
      عدم اطمینان مواجه ساخته و این امر سبب گردیده تا فروشگاه‌های اینترنتی
      بتوانند با حل بسیاری از مشکلات فوق، تبدیل به انتخاب اول کاربران شوند.در
      برق شهر می توانید اطمینان یابید که محصول شما از کیفیت بالایی برخوردار است
      است.
    </div>
  );
}
